[{"term":"10Base-T - 10 Megabit (Velocidade de Transmissão):","definition":"Este padrão utiliza cabos de par trançado (o \n\"T\" vem de Twisted-pair). O comprimento máximo do cabo é de 100 metros, permitindo a \ntransmissão de dados entre os hosts. Para distâncias maiores, é possível usar repetidores para \namplificar o sinal ou switches para segmentar a rede e estender seu alcance."},{"term":"100Base-TX - 100 Megabit (Velocidade de Transmissão):","definition":"Por volta de 1995, o padrão Fast Ethernet \nfoi desenvolvido para oferecer velocidades de transmissão mais altas.. Existem três variantes do Fast \nEthernet, sendo que a mais utilizada é a \n100BASE\nTX. Este padrão utiliza cabos de par trançado, \ngeralmente do tipo CAT5 ou superiores, e é empregado \nem mais de 80% das redes Ethernet atuais."},{"term":"1000Base-T - 1000 Megabit (Velocidade de Transmissão):","definition":". Os cabos utilizados são \ndo tipo Cat5e ou superiores, como Cat6. Este padrão permite a transmissão de dados a 1 Gigabit por \nsegundo, com um comprimento máximo de cabo de até 100 metros. Devido à alta taxa de \ntransmissão, 1000Base-T é mais suscetível a interferências e degradação do sinal em cabos muito \nlongos ou de baixa qualidade."},{"term":"Meio Físico ou Camada Física","definition":"Função Principal: Transformar o quadro Ethernet em sinais que possam ser transmitidos pelo meio \nde comunicação."},{"term":"MAC (Controle de Acesso ao Meio)","definition":"Função Principal: Montar o quadro Ethernet que será enviado pela rede."},{"term":"LLC (Controle de Link Lógico)","definition":"Função Principal: Identificar o protocolo de nível superior para entregar as informações contidas no \nquadro Ethernet recebido."},{"term":"Endereçamento","definition":"O endereçamento de rede ou simplesmente endereço IP é um número binário (0 e 1) que especifica \nde maneira única um host conectado à uma rede TCP/IP."},{"term":"Diagnóstico e Solução de Problemas","definition":"Profissionais de redes habilidosos podem identificar rapidamente a origem dos problemas usando \nferramentas de diagnóstico, como ping, traceroute, analisadores de protocolo e registros de \neventos. Eles também compreendem os princípios de resolução de problemas em camadas, \ncomeçando pela camada física (cabos, conectores) e progredindo até as camadas de aplicativos \n(softwares).\n Além disso, a solução de problemas requer habilidades de resolução de problemas e pensamento \nlógico. Os profissionais de redes devem ser capazes de isolar problemas, tomar medidas corretivas \neficazes e documentar suas descobertas para futuras referências."},{"term":"Atualização e Migração de Padrões","definition":"Profissionais de redes experientes devem estar cientes das últimas tendências em tecnologia de \nredes, como a migração para redes baseadas em nuvem, a implementação de IPv6 para substituir o \nIPv4 envelhecido e a adoção de protocolos de segurança mais robustos.\n Além disso, eles devem ser capazes de planejar e executar migrações de padrões com o mínimo de \ninterrupção para a operação da rede. Isso envolve a atualização de hardware e software, a migração \nde dados e a realização de testes rigorosos para garantir a integridade da rede após a migração."},{"term":"Negociação de Velocidade e Duplex","definition":"A negociação de velocidade e duplex é uma habilidade crucial para otimizar o desempenho da rede \ne garantir uma comunicação eficaz entre dispositivos. Velocidade se refere à taxa de transferência \nde dados entre os dispositivos, enquanto duplex se refere à capacidade de transmitir e receber \ndados simultaneamente."},{"term":"Seleção e Configuração de Cabos","definition":"Um profissional de redes precisa ser capaz de escolher o tipo certo de cabo com base nos requisitos \nda rede, como distância, largura de banda e ambiente. Eles também devem saber como configurar \ncorretamente os conectores, emendas e terminações dos cabos para garantir uma conexão sólida e \nde alta qualidade."},{"term":"Implementação de Redes em Conformidade","definition":"Profissionais de redes precisam entender os requisitos de conformidade relevantes para suas redes, \nque podem variar dependendo da indústria e da localização geográfica. Eles devem ser capazes de \nimplementar medidas de segurança, como criptografia, autenticação e controle de acesso, para \nproteger os dados e a integridade da rede."}]